name: "simple"

########## [INPUT] ##########

layer { name: "data"
  include { phase: TRAIN }
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "/media/raid_arr/data/otto/data/train_fold0"
    backend: LEVELDB
    #batch_size: 4096
    batch_size: 8192
    #batch_size: 16384
  }
  #transform_param { mean_value: 0 }
}

layer { name: "data_pl"
  include { phase: TRAIN }
  type: "Data"
  top: "data_pl"
  top: "label_pl_truth"
  data_param {
    #~ source: "/media/raid_arr/data/otto/data/test_fold0_copy"
    source: "/media/raid_arr/data/otto/data/test_lvl"
    backend: LEVELDB
    #~ batch_size: 8192
    batch_size: 16384
  }
  #transform_param { mean_value: 0 }
}

layer { name: "silencer"
    include { phase: TRAIN }
    type: "Silence"
    bottom: "label_pl_truth"
}

layer { name: "data"
  include { phase: TEST }
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "/media/raid_arr/data/otto/data/test_fold0"
    backend: LEVELDB
    batch_size: 512
  }
  #transform_param { mean_value: 0 }
}

########## [NET] ##########

layer { name: "fc1"
  type: "InnerProduct"
  bottom: "data"
  top: "fc1"
  param { name: "fc1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param { name: "fc1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer{ name: "slice_fc1"
  type: "Slice"
  bottom: "fc1"
  top: "s1fc1"
  top: "s2fc1"
  top: "s3fc1"
  top: "s4fc1"
  slice_param: {
      slice_dim: 1
      slice_point: 512
      slice_point: 1024
      slice_point: 1536
  }
}
layer { name: "maxfeat1"
  type: "Eltwise"
  bottom: "s1fc1"
  bottom: "s2fc1"
  bottom: "s3fc1"
  bottom: "s4fc1"
  top: "maxfc1"
  eltwise_param {
      operation: MAX
  }
}
layer { name: "drop1"
  type: "Dropout"
  bottom: "maxfc1"
  top: "maxfc1"
  dropout_param {
     dropout_ratio: 0.5
  }
}

layer { name: "fc2"
  type: "InnerProduct"
  bottom: "maxfc1"
  top: "fc2"
  param { name: "fc2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param { name: "fc2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer{ name: "slice_fc2"
  type: "Slice"
  bottom: "fc2"
  top: "s1fc2"
  top: "s2fc2"
  top: "s3fc2"
  top: "s4fc2"
  slice_param: {
      slice_dim: 1
      slice_point: 512
      slice_point: 1024
      slice_point: 1536
  }
}
layer { name: "maxfeat2"
  type: "Eltwise"
  bottom: "s1fc2"
  bottom: "s2fc2"
  bottom: "s3fc2"
  bottom: "s4fc2"
  top: "maxfc2"
  eltwise_param {
      operation: MAX
  }
}
layer { name: "drop2"
  type: "Dropout"
  bottom: "maxfc2"
  top: "maxfc2"
  dropout_param {
     dropout_ratio: 0.5
  }
}


########## [NET_PL] ##########
layer { name: "fc1_pl"
  include { phase: TRAIN }
  type: "InnerProduct"
  bottom: "data_pl"
  top: "fc1_pl"
  param {
    name: "fc1_w"
    lr_mult: 0.0  # No backprop
  }
  param {
    name: "fc1_b"
    lr_mult: 0.0  # No backprop 
  }
  inner_product_param {
    num_output: 2048
  }
}
layer{ name: "slice_fc1_pl"
  include { phase: TRAIN }
  type: "Slice"
  bottom: "fc1_pl"
  top: "s1fc1_pl"
  top: "s2fc1_pl"
  top: "s3fc1_pl"
  top: "s4fc1_pl"
  slice_param: {
      slice_dim: 1
      slice_point: 512
      slice_point: 1024
      slice_point: 1536
  }
}
layer { name: "maxfeat1_pl"
  include { phase: TRAIN }
  type: "Eltwise"
  bottom: "s1fc1_pl"
  bottom: "s2fc1_pl"
  bottom: "s3fc1_pl"
  bottom: "s4fc1_pl"
  top: "maxfc1_pl"
  eltwise_param {
      operation: MAX
  }
}

layer { name: "fc2_pl"
  include { phase: TRAIN }
  type: "InnerProduct"
  bottom: "maxfc1_pl"
  top: "fc2_pl"
  param { name: "fc2_w"
    lr_mult: 0.0  # No backprop 
  }
  param { name: "fc2_b"
    lr_mult: 0.0  # No backprop 
  }
  inner_product_param {
    num_output: 2048
  }
}
layer{ name: "slice_fc2_pl"
  include { phase: TRAIN }
  type: "Slice"
  bottom: "fc2_pl"
  top: "s1fc2_pl"
  top: "s2fc2_pl"
  top: "s3fc2_pl"
  top: "s4fc2_pl"
  slice_param: {
      slice_dim: 1
      slice_point: 512
      slice_point: 1024
      slice_point: 1536
  }
}
layer { name: "maxfeat2_pl"
  include { phase: TRAIN }
  type: "Eltwise"
  bottom: "s1fc2_pl"
  bottom: "s2fc2_pl"
  bottom: "s3fc2_pl"
  bottom: "s4fc2_pl"
  top: "maxfc2_pl"
  eltwise_param {
      operation: MAX
  }
}

### OUTPUT LAYERS

layer { name: "fc_out"
  type: "InnerProduct"
  bottom: "maxfc2"
  top: "fc_out"
  param { name: "fc_out_w"
    lr_mult: 1
    decay_mult: 1
  }
  param { name: "fc_out_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 9
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer { name: "fc_out_pl"
  include { phase: TRAIN }
  type: "InnerProduct"
  bottom: "maxfc2_pl"
  top: "fc_out_pl"
  param { name: "fc_out_w"
    lr_mult: 0.0  # No backprop 
  }
  param { name: "fc_out_b"
    lr_mult: 0.0  # No backprop 
  }
  inner_product_param {
    num_output: 9
  }
}

layer { name: "accuracy"
  include { phase: TEST }
  type: "Accuracy"
  bottom: "fc_out"
  bottom: "label"
  top: "accuracy"
}

layer { name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc_out"
  bottom: "label"
  top: "loss"
  loss_weight: 1.0
}

layer { name: "pseudo_label"
  include { phase: TRAIN }
  type: "ArgMax" 
  bottom: "fc_out_pl"
  top: "label_pl"
}

layer { name: "loss_pl"
  include { phase: TRAIN }
  type: "SoftmaxWithLoss"
  bottom: "fc_out_pl"
  bottom: "label_pl"
  top: "loss_pl"
  loss_weight: 0.75
  #~ loss_weight: 2.00
  #~ loss_weight: 1.50
  #~ loss_weight: 0.50
}


