name: "simple"

########## [INPUT] ##########

layer {
  include { phase: TRAIN }
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "/media/raid_arr/data/otto/data/train_fold0"
    backend: LEVELDB
    #batch_size: 4096
    batch_size: 8192
    #batch_size: 16384
  }
  #transform_param { mean_value: 0 }
}

layer {
  include { phase: TRAIN }
  name: "data_pl"
  type: "Data"
  top: "data_pl"
  top: "label_pl_truth"
  data_param {
    source: "/media/raid_arr/data/otto/data/test_fold0_copy"
    backend: LEVELDB
    batch_size: 2048
  }
  #transform_param { mean_value: 0 }
}

layer {
    include { phase: TRAIN }
    name: "silencer"
    type: "Silence"
    bottom: "label_pl_truth"
}

layer {
  include { phase: TEST }
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "/media/raid_arr/data/otto/data/test_fold0"
    backend: LEVELDB
    batch_size: 512
  }
  #transform_param { mean_value: 0 }
}

########## [NET] ##########

layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "data"
  top: "fc1"
  param {
    name: "fc1_w"  
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "fc1"
  top: "maxfc1"
  relu_param: {
      negative_slope: 0.00
  }
}
layer {
  name: "drop1"
  type: "Dropout"
  bottom: "maxfc1"
  top: "maxfc1"
  dropout_param {
     dropout_ratio: 0.5
  }
}

layer {
  name: "fc2"
  type: "InnerProduct"
  bottom: "maxfc1"
  top: "fc2"
  param {
    name: "fc2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "fc2"
  top: "maxfc2"
  relu_param: {
      negative_slope: 0.00
  }
}

layer {
  name: "drop2"
  type: "Dropout"
  bottom: "maxfc2"
  top: "maxfc2"
  dropout_param {
     dropout_ratio: 0.5
  }
}


########## [NET_PL] ##########
layer {
  include { phase: TRAIN }
  name: "fc1_pl"
  type: "InnerProduct"
  bottom: "data_pl"
  top: "fc1_pl"
  param {
    name: "fc1_w"
    lr_mult: 0.0  # No backprop
  }
  param {
    name: "fc1_b"
    lr_mult: 0.0  # No backprop 
  }
  inner_product_param {
    num_output: 512
  }
}
layer {
  include { phase: TRAIN }
  name: "relu1_pl"
  type: "ReLU"
  bottom: "fc1_pl"
  top: "maxfc1_pl"
}
layer {
  include { phase: TRAIN }
  name: "drop1_pl"
  type: "Dropout"
  bottom: "maxfc1_pl"
  top: "maxfc1_pl"
  dropout_param {
     dropout_ratio: 0.5
  }
}  

layer {
  include { phase: TRAIN }
  name: "fc2_pl"
  type: "InnerProduct"
  bottom: "maxfc1_pl"
  top: "fc2_pl"
  param {
    name: "fc2_w"
    lr_mult: 0.0  # No backprop 
  }
  param {
    name: "fc2_b"
    lr_mult: 0.0  # No backprop 
  }
  inner_product_param {
    num_output: 512
  }
}
layer {
  include { phase: TRAIN }
  name: "relu2_pl"
  type: "ReLU"
  bottom: "fc2_pl"
  top: "maxfc2_pl"
}

layer {
  include { phase: TRAIN }
  name: "drop2_pl"
  type: "Dropout"
  bottom: "maxfc2_pl"
  top: "maxfc2_pl"
  dropout_param {
     dropout_ratio: 0.5
  }
}   

### OUTPUT LAYERS

layer {
  name: "fc_out"
  type: "InnerProduct"
  bottom: "maxfc2"
  top: "fc_out"
  param {
    name: "fc_out_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc_out_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 9
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  include { phase: TRAIN }
  name: "fc_out_pl"
  type: "InnerProduct"
  bottom: "maxfc2_pl"
  top: "fc_out_pl"
  param {
    name: "fc_out_w"
    lr_mult: 0.0  # No backprop 
  }
  param {
    name: "fc_out_b"
    lr_mult: 0.0  # No backprop 
  }
  inner_product_param {
    num_output: 9
  }
}


layer {
  include { phase: TEST }
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc_out"
  bottom: "label"
  top: "accuracy"
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc_out"
  bottom: "label"
  top: "loss"
  loss_weight: 1.0
}



layer {
  include { phase: TRAIN }
  name: "pseudo_label"
  type: "ArgMax" 
  bottom: "fc_out_pl"
  top: "label_pl"
}

layer {
  include { phase: TRAIN }
  name: "loss_pl"
  type: "SoftmaxWithLoss"
  bottom: "fc_out_pl"
  bottom: "label_pl"
  top: "loss_pl"
  loss_weight: 0.1
}


